library(TTR)                                    # TTR 套件
r.File = "c:/Remi/Remi Moocs/Data/TTrade.csv"   # 檔案的路徑

#############################################################################
CSV    = read.csv(r.File)                       # 讀取 csv 檔
head(CSV)                                       # 呈現前 6 筆已讀取的資料
close  = CSV[, 5]                               # 只需用到收盤價 (在第 5 個欄位)

#############################################################################
sma    = SMA(close, n = 7)                      # 計算 n = 7 的簡單移動平均
head(sma, 10)                                   # 呈現前 10 筆的簡單移動平均結果

ema    = EMA(close, n = 7)                      # 計算 n = 7 的指數移動平均
head(ema, 10)                                   # 呈現前 10 筆的指數移動平均結果
